---
kind: other
id: Methods.T:Autodesk.Revit.DB.Structure.RebarShapeConstraintAngleFromFixedDir
source: html/14d2e804-fc91-d84d-62f8-d0a2de166ae0.htm
---
# RebarShapeConstraintAngleFromFixedDir Methods

Return the Id of the parameter associated with this constraint.